In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'name':['ali','hossein','sara'],'age':[22,35,27]}
df = pd.DataFrame(data)
df

      name  age
0      ali   22
1  hossein   35
2     sara   27

In [3]:
df['city']=['tehran','esfahan','mashhad']
df

      name  age     city
0      ali   22   tehran
1  hossein   35  esfahan
2     sara   27  mashhad

In [5]:
df = df[['name','city']]
df

      name     city
0      ali   tehran
1  hossein  esfahan
2     sara  mashhad

In [7]:
data = {'name':['ali','hossein','sara'],'age':[22,35,27]}
df = pd.DataFrame(data,index=['person 1','person 2 ','person 3'])
df

              name  age
person 1       ali   22
person 2   hossein   35
person 3      sara   27

In [10]:
print(df.loc[['person 1']])

         name  age
person 1  ali   22

In [11]:
print(df.iloc[[1]])

              name  age
person 2   hossein   35

In [16]:
print(df.loc['person 1':'person 3'])

              name  age
person 1       ali   22
person 2   hossein   35
person 3      sara   27

In [19]:
print(df.loc['person 1',['age','name']])

age      22
name    ali
Name: person 1, dtype: object

In [20]:
print(df.iloc[:1,:2])

         name  age
person 1  ali   22